[
  {
    "text": "Why did the contractor bring a ladder to the meeting? To take the discussion to the next level.",
    "category": "Construction Humor",
    "visible": true
  },
  {
    "text": "Estimators don’t age — they just adjust their rates.",
    "category": "Estimator Jokes",
    "visible": true
  },
  {
    "text": "Safety first, coffee second, deadlines third.",
    "category": "Field Life Laughs",
    "visible": true
  },
  {
    "text": "If duct tape can’t fix it, try more duct tape.",
    "category": "Field Life Laughs",
    "visible": true
  },
  {
    "text": "Client: ‘Can you finish early?’ Contractor: ‘Sure, if you pay early.’",
    "category": "Client-Friendly Fun",
    "visible": true
  },
  {
    "text": "Why did the contractor break up with his level?\nBecause she just couldn’t stay on the same plane anymore.",
    "category": "Construction Humor",
    "visible": true
  },
  {
    "text": "Why did the estimator go broke? Because he kept losing his balance sheet.\n\nI told my boss I needed a raise — he said, “You already have one… it’s called ‘expectations.’”\n\nWhy do construction workers make great DJs? They know how to drop the base.\n\nConcrete jokes aren’t funny… but they’re solid.\n\nMy architect friend has a great plan — it’s just not drawn yet.\n\nWhy don’t builders ever play hide and seek? Because good luck hiding a crane.\n\nThe drywall said it was bored — I told it to hang in there.\n\nWhy did the foreman get promoted? He nailed every opportunity.\n\nThat electrician’s humor is shocking — but current.\n\nMy plumber’s jokes always leak out before the punchline.\n\nI asked ChatGPT for a joke… it said, “I’m funnier in premium.”\n\nWi-Fi went down for five minutes — so I talked to my family. Seems they’re nice people.\n\nWhy did the computer go to therapy? Too many bytes from its past.\n\nMy password is “incorrect,” so when I forget it, the computer reminds me.\n\nThe cloud isn’t safe — mine just rained all my photos.\n\nI told my laptop I needed space… now it won’t stop deleting files.\n\n404: Joke not found.\n\nI would tell you a data joke, but it’s still being processed.\n\nMy favorite app is “Nap.” It crashes regularly, but I still use it.\n\nThe robot didn’t laugh — guess it didn’t have a sense of humor.exe.\n\nI used to play piano by ear — now I use my hands.\n\nI told my friend she was drawing her eyebrows too high. She looked surprised.\n\nI’m on a whiskey diet. I’ve lost three days already.\n\nI told my doctor I broke my arm in two places. He said, “Then stop going to those places.”\n\nI asked my wife what she wanted for dinner — she said, “Something edible.”\n\nI’m not lazy; I’m on energy-saving mode.\n\nI’d give up sarcasm, but that would be a huge loss for humanity.\n\nMy wallet is like an onion — opening it makes me cry.\n\nI’m not arguing, I’m just explaining why I’m right.\n\nCommon sense is like deodorant. The people who need it most never use it.\n\nI tried to build a joke — but I ran out of material.\n\nThe site manager said I had potential — just needed more concrete results.\n\nRebar jokes are strong, but they tend to bend under pressure.\n\nSteel yourself before hearing this next one.\n\nMy favorite building material? Humor — it holds everything together.\n\nThe blueprint had a typo — now we’re building a “moose.”\n\nI told the carpenter a joke… he nailed it.\n\nThe brick said to the wall, “Together, we stand tall.”\n\nCement mixers have the best rhythm — they’re always rolling.\n\nIf construction workers made movies, they’d all be blockbusters.\n\nOutlook just crashed again — looks like it couldn’t handle my ambition.\n\nI sent a funny email to HR. Still waiting for the reply… and possibly unemployment.\n\nWhy did the employee bring string to work? To tie up loose ends.\n\nMy boss told me to think outside the box — so I went home.\n\nMondays are proof that time travel is real — we go from Friday to Monday instantly.\n\n“Teamwork” means doing it all yourself while everyone else “collaborates.”\n\nMy desk is a reflection of my mind — cluttered but functional.\n\nI don’t need an inspirational quote. I need coffee.\n\nMy email tone? Somewhere between professional and passive-aggressive.\n\nI renamed my Wi-Fi to “JobSearch” so my boss thinks I’m motivated.\n\nParallel lines have so much in common — it’s a shame they’ll never meet.\n\nI asked my dog what two minus two was. He said nothing.\n\nI told my suitcase there would be no vacation this year — now I’m dealing with emotional baggage.\n\nWhy did the scarecrow win an award? He was outstanding in his field.\n\nI know they say money talks — but all mine says is “Goodbye.”\n\nI told my phone it was getting slow — now we’re not on speaking terms.\n\nI’m not short-tempered, I’m just quickly expressive.\n\nI hate it when people use big words just to sound perspicacious.\n\nWhy don’t skeletons fight? They don’t have the guts.\n\nTime flies like an arrow. Fruit flies like a banana.\n\nThe hammer started a podcast — it’s called “Nailed It.”\n\nI told the screwdriver to loosen up.\n\nThe saw quit its job — said it couldn’t handle the pressure.\n\nMy tape measure keeps lying — it always stretches the truth.\n\nThe drill didn’t get promoted. It just keeps going in circles.\n\nMy wrench has attitude — total torque-ative.\n\nYou can’t screw up a good plan — unless you’re using a stripped screw.\n\nTools gossip a lot — mostly behind your back.\n\nThe level always keeps things balanced.\n\nWhen in doubt, duct tape it out.\n\nI told a chemistry joke — no reaction.\n\nI’m friends with 25 letters of the alphabet. I don’t know Y.\n\nThe rotation of Earth really makes my day.\n\nI’m reading a book on anti-gravity — it’s impossible to put down.\n\nI used to be addicted to soap, but I’m clean now.\n\nWhat’s orange and sounds like a parrot? A carrot.\n\nI told my GPS to take me somewhere fun. It drove me to the liquor store.\n\nDid you hear about the claustrophobic astronaut? He just needed a little space.\n\nNever trust atoms — they make up everything.\n\nI asked the librarian if the library had any books on paranoia. She whispered, “They’re right behind you.”\n\nSuccess is like Wi-Fi — the closer you are to the source, the stronger the connection.\n\nMy life is a construction site — still in progress.\n\nSometimes the hardest work is pretending to look busy.\n\nEvery great idea starts with “This might be stupid, but…”\n\nI don’t procrastinate — I’m just giving ideas time to marinate.\n\nDon’t count your problems. Use a calculator.\n\nI’m not clumsy — the floor just hates me.\n\nI like my coffee how I like my mornings — nonexistent.\n\nIf you think nobody cares, try missing a deadline.\n\nPatience is what you have when there are too many tabs open.\n\nWhy don’t we ever see elephants hiding in trees? Because they’re good at it.\n\nI told my shadow to back off — it’s been following me everywhere.\n\nMy mirror and I are not on speaking terms.\n\nIf life gives you lemons, sell them. Inflation’s crazy.\n\nI bought a belt that’s a clock — it’s a waist of time.\n\nWhy did the tomato blush? It saw the salad dressing.\n\nI accidentally swallowed some Scrabble tiles. My next trip to the bathroom could spell disaster.\n\nI just burned 1,200 calories — I forgot the pizza in the oven.\n\nMy friend said he didn’t understand cloning. I told him, “That makes two of us.”\n\nNever trust stairs — they’re always up to something.",
    "category": "Construction Humor",
    "visible": true
  }
]